tannewt/circuitpython/ports/espressif/boards/espressif_esp32p4_function_ev/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2025 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "ESP32-P4-Function-EV"
#define MICROPY_HW_MCU_NAME         "ESP32P4"

#define CIRCUITPY_BOOT_BUTTON       (&pin_GPIO0)

#define DEFAULT_UART_BUS_RX         (&pin_GPIO38)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO37)

#define DEFAULT_I2C_BUS_SCL         (&pin_GPIO8)
#define DEFAULT_I2C_BUS_SDA         (&pin_GPIO7)

// Dual USB device mode: both FS (port 0) and HS (port 1)
#define CIRCUITPY_USB_DEVICE_DUAL (1)
// Use the second USB device (numbered 0 and 1)
#define CIRCUITPY_USB_DEVICE_INSTANCE 1
#define CIRCUITPY_USB_DEVICE_HIGH_SPEED (1)

#define CIRCUITPY_USB_HOST_INSTANCE 0
